

import axios from "axios";



const api = axios.create({

baseURL : "https://chatapp-production-7953.up.railway.app" ,

withCredentials: true,

headers : {

 "Content-Type" : "application/json"

}


})


// احنا عايزين لما نعمل طلب لازم يعدي على اجيكس هنا عشان يتأكد من توكين مستخدم ويتأكد من هويتوة دة اول حاجة تاني حاجة انت عايز في كل طلب تبعتوة لباك اند محتاج تستخدم كل طلب في كل صفحة عشان تجيب طلب معين هنا بقي اجيكس وفرهالك وشالهالك بدل ما تبعت 50 طلب لكل صفحة هنا تكتب سطر واحد تقدر من خلالة تجيب كل حاجة واي طلب تبعتوة ميخرجش برة سطر دي غير لما يتأكد من هوية مستخدم 

// الفكرة انت كنت بتبعتلوة بيانات وتطلب وهو مش عارف توكين دة بتاع مين اساسا باك اند مش عارف توكين دة بتاع مين عشان كدة ضربلك ايرورر 

api.interceptors.request.use((confing)=> {


const token = localStorage.getItem("token") 


if(token){

confing.headers.Authorization = `Bearer ${token}` // بقولوة اي طلب يعدي فروند اند يبعتوة لباك اند ابعت معاة قبل ماتبعت لباك اند ابعت معاة توكين عشان باك اند يتأكد من هوية مستخدم مع كونيفنج

}

// confing دة مجرد اسم بارميتر وهو عبارة عن اوبجكيت اي طلب فروند اند يبعتوة لباك اند الفروند يبعتوة على هيئة اوبجكيت قبل ما طلب يخرج من متصفح ويروح سيرفر بيحطلك بيانات مستخدم بالتوكين بتاعة وبعدها يروح يبعتهالوة جيسون اللى هو سطر فوق معرفوة فوق ان داتا هتجيلك على شكل جيسون

return confing // رجعلي اوبجكيت في اخر ودية السيرفر باك اند

})



export default api