




// هنربط سوكيت بتاع باك اند مع فروند اند عشان يكون على اتصال بسيرفر دايما

import { io } from "socket.io-client";





const socket = io("https://quick-chat-api.bonto.run" , {

 auth : {

     token : typeof window !== "undefined" ? localStorage.getItem("token") : null
 }
 

// طبعا نيكست جيس شغال على سيرفر وشغال على متصفح ولوكيل ستوريج متخزن في متصفح بقولوة اتاكدلي الاول ان انا واقف في متصفح يعني مش انديفينت لان ممكن نيكست جيس يكون سيرفر بتاعوة بيهيأ نفسة عشان يشتغل نفسة قبل ما يروح للمتصفح بقولوة اتأكدلي اني انا واقف في متصفح ولو انا واقف في متصفح هاتلي توكين بتاع مستخدم دة من لوكيل ستوريج ولو طلع اني انا مش واقف في صفحة ويندو بدل مترميلي ايرورر ارميلي نال 

// الفكرة احنا بنربط سطر كود دة بالسيرفر باك اند ونشوف انهي مستخدم فاتح دلوقتي  

})



export default socket

